package com.jt.mvpstudio.other.utils;

import java.util.List;

/**
 * Created by Administrator on 2018/8/17 0017.
 */

public class BookBean {

    /**
     * count : 20
     * start : 0
     * total : 1171
     * books : [{"rating":{"max":10,"numRaters":24818,"average":"8.5","min":0},"subtitle":"","author":["[明] 施耐庵","罗贯中"],"pubdate":"1997-1","tags":[{"count":4116,"name":"古典文学","title":"古典文学"},{"count":2969,"name":"水浒传","title":"水浒传"},{"count":2553,"name":"四大名著","title":"四大名著"},{"count":2490,"name":"小说","title":"小说"},{"count":1402,"name":"中国","title":"中国"},{"count":1356,"name":"古典名著","title":"古典名著"},{"count":1046,"name":"经典","title":"经典"},{"count":976,"name":"名著","title":"名著"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s1147854.jpg","binding":"平装","translator":[],"catalog":"引首\n第一回 张天师祈禳瘟疫 洪太尉误走妖魔\n第二回 王教头私走延安府 九纹龙大闹史家村\n第三回 史大郎夜走华阴县 鲁提辖拳打镇关西\n第四回 赵员外重修文殊院 鲁智深大闹五台山\n第五回 小霸王醉入销金帐 花和尚大闹桃花村\n第六回 九纹龙剪径赤松林 鲁智深火烧瓦罐寺\n第七回 花和尚倒拔垂杨柳 豹子头误入白虎堂\n第八回 林教头刺配沧州道 鲁智深大闹野猪林\n第九回 柴进门招天下客 林冲棒打洪教头\n第十回 林教头风雪山神庙 陆虞候火烧草料场\n第十一回 朱贵水亭施号箭 林冲雪夜上梁山\n第十二回 梁山泊林冲落草 汴京城杨志卖刀\n第十三回 急先锋东郭争功 青面兽北京斗争\n第十四回 赤发鬼醉卧灵官殿 晁天王认义东溪村\n\u2026\u2026","pages":"1314","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s1147854.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s1147854.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s1147854.jpg"},"alt":"https://book.douban.com/subject/1008357/","id":"1008357","publisher":"人民文学出版社","isbn10":"7020008747","isbn13":"9787020008742","title":"水浒传（全二册）","url":"https://api.douban.com/v2/book/1008357","alt_title":"","author_intro":"","summary":"《水浒传》是我国第一部以农民起义为题材的长篇章回小说，是我国文学史上一座巍然屹立的丰碑，也是世界文学宝库中一颗光彩夺目的明珠。数百年来，它一直深受我国人民的喜爱，并被译为多种文字，成为我国流传最为广泛的古代长篇小说之一。\n    《水浒传》具体而生动地描写了以宋江为首的农民起义发生、发展直至失财的整个过程，揭露了封建社会的黑暗、腐朽和统治阶级的种种罪恶，热情歌颂了起义英雄的反抗精神和正义行动，塑造了一大批梁山好汉的光辉形象，形象地揭示了封建社会\u201c官逼民反\u201d的客观真理和农民起义失败的内在原因。","series":{"id":"106","title":"中国古典文学读本丛书"},"price":"50.60元"},{"rating":{"max":10,"numRaters":2850,"average":"8.8","min":0},"subtitle":"容与堂本","pubdate":"1975-10","image":"https://img1.doubanio.com/view/subject/m/public/s3846669.jpg","binding":"","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s3846669.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s3846669.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s3846669.jpg"},"alt":"https://book.douban.com/subject/2042562/","id":"2042562","title":"水浒传","author_intro":"","tags":[{"count":388,"name":"古典文学","title":"古典文学"},{"count":334,"name":"施耐庵","title":"施耐庵"},{"count":333,"name":"小说","title":"小说"},{"count":293,"name":"中国古典文学","title":"中国古典文学"},{"count":217,"name":"名著","title":"名著"},{"count":211,"name":"水浒","title":"水浒"},{"count":199,"name":"四大名著","title":"四大名著"},{"count":198,"name":"经典","title":"经典"}],"origin_title":"","price":"11.10元","translator":[],"catalog":"","pages":"1400","publisher":"人民文学出版社","isbn10":"SH10019-2317","alt_title":"","url":"https://api.douban.com/v2/book/2042562","author":["施耐庵","罗贯中"],"summary":"100回本"},{"rating":{"max":10,"numRaters":1716,"average":"8.8","min":0},"subtitle":"","author":["[明] 施耐庵","罗贯中"],"pubdate":"1990-8","tags":[{"count":286,"name":"古典文学","title":"古典文学"},{"count":244,"name":"小说","title":"小说"},{"count":214,"name":"施耐庵","title":"施耐庵"},{"count":182,"name":"水浒传","title":"水浒传"},{"count":164,"name":"古典名著","title":"古典名著"},{"count":132,"name":"中国古典文学","title":"中国古典文学"},{"count":117,"name":"中国文学","title":"中国文学"},{"count":90,"name":"四大名著","title":"四大名著"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s23574262.jpg","binding":"精装","translator":[],"catalog":"目 录\n引 首\n第一回 张天师祈攘瘟疫 洪太尉误走妖魔\n第二回 王教头私走延安府 九纹龙大闹史家村\n第三回 史大郎夜走华阴县 鲁提辖拳打镇关西\n第四回 赵员外重修文殊院 鲁智深大闹五台山\n第五回 小霸王醉入销金帐 花和尚大闹桃花村\n第六回 九纹龙剪径赤松林 鲁智深火烧瓦罐寺\n第七回 花和尚倒拔垂杨柳 豹子头误入白虎堂\n第八回 林教头刺配沧州道 鲁智深大闹野猪林\n第九回 柴进门招天下客 林冲棒打洪教头\n第十回 林教头风雪山神庙 陆虞候火烧草料场\n第十一回 朱贵水亭施号箭 林冲雪夜上梁山\n第十二回 梁山泊林冲落草 汴京城杨志卖刀\n第十三回 急先锋东郭争功 青面兽北京斗武\n第十四回 赤发鬼醉卧灵官殿 晁天王认义东溪村\n第十五回 吴学究说三阮撞筹 公孙胜应七星聚义\n第十六回 杨志押送金银担 吴用智取生辰纲\n第十七回 花和尚单打二龙山 青面兽双夺宝珠寺\n第十八回 美髯公智稳插翅虎 宋公明私放晁天王\n第十九回 林冲水寨大�火 晁盖梁山小夺泊\n第二十回 梁山泊义士尊晁盖 郓城县月夜走刘唐\n第二十一回 虔婆醉打唐牛儿 宋江怒杀阎婆惜\n第二十二回 阎婆大闹郓城县 朱仝义释宋公明\n第二十三回 横海郡柴进留宾 景阳冈武松打虎\n第二十四回 王婆贪贿说风情 郓哥不忿闹茶肆\n第二十五回 王婆计啜西门庆 淫妇药鸩武大郎\n第二十六回 郓哥大闹授官厅 武松斗杀西门庆\n第二十七回 母夜叉孟州道卖人肉 武都头十字坡遇张青\n第二十八回 武松威镇安平寨 施恩义夺快活林\n第二十九回 施恩重霸孟州道 武松醉打蒋门神\n第三十回 施恩三入死囚牢 武松大闹飞云浦\n第三十一回 张都监血溅鸳鸯楼 武行者夜走蜈蚣岭\n第三十二回 武行者醉打孔亮 锦毛虎义释宋江\n第三十三回 宋江夜看小鳌山 花荣大闹清风寨\n第三十四回 镇三山大闹青州道 霹雳火夜走瓦砾场\n第三十五回 石将军村店寄书 小李广梁山射雁\n第三十六回 梁山泊吴用举戴宗 揭阳岭宋江逢李俊\n第三十七回 没遮拦追赶及时雨 船火儿夜闹浔阳江\n第三十八回 及时雨会神行太保 黑旋风斗浪里白跳\n第三十九回 浔阳楼宋江吟反诗 梁山泊戴宗传假信\n第四十回 梁山泊好汉劫法场 白龙庙英雄小聚义\n第四十一回 宋江智取元为军 张顺活捉黄文炳\n第四十二回 还道村受三卷天书 宋公明遇九天玄女\n第四十三回 假李逵剪径劫单人 黑旋风沂岭杀四虎\n第四十四回 锦豹子小径逢戴宗 病关索长街遇石秀\n第四十五回 杨雄醉骂潘巧云 石秀智杀裴如海\n第四十六回 病关索大闹翠屏山 拚命三火烧祝家庄\n第四十七回 扑天雕双修生死书 宋公明一打祝家庄\n第四十八回 一丈青单捉王矮虎 宋公明两打祝家庄\n第四十九回 解珍解宝双越狱 孙立孙新大劫牢\n第五十回 吴学究双用连环计 宋公明三打祝家庄\n第五十一回 插翅虎枷打白秀英 美髯公误失小衙内\n第五十二回 李逵打死殷天锡 柴进失陷高唐州\n第五十三回 戴宗智取公孙胜 李逵斧劈罗真人\n第五十四回 入云龙斗法破高廉 黑旋风探穴救柴进\n第五十五回 高太尉大兴三路兵 呼延灼摆布连环马\n第五十六回 吴用使时迁盗甲 汤隆赚徐宁上山\n第五十七回 徐宁教使钩镰枪 宋江大破连环马\n第五十八回 三山聚义打青州 众虎同心归水泊\n第五十九回 吴用赚金铃吊挂 宋江闹西岳华山\n第六十回 公孙胜芒砀山降魔 晁天王曾头市中箭\n第六十一回 吴用智赚玉麒麟 张顺夜闹金沙渡\n第六十二回 放冷箭燕青救主 劫法场石秀跳楼\n第六十三回 宋江兵打北京城 关胜议取梁山泊\n第六十四回 呼延灼夜月赚关胜 宋公明雪天擒索超\n第六十五回 托塔天王梦中显圣 浪里白跳水上报冤\n第六十六回 时迁火烧翠云楼 吴用智取大名府\n第六十七回 宋江赏马步三军 关胜降水火二将\n第六十八回 宋公明夜打曾头市 卢俊义活捉史文恭\n第六十九回 东平府误陷九纹龙 宋公明义释双枪将\n第七十回 没羽箭飞石打英雄 宋公明弃粮擒壮士\n第七十一回 忠义堂石碣受天文 梁山泊英雄排座次\n第七十二回 柴进簪花入禁院 李逵元夜闹东京\n第七十三回 黑旋风乔捉鬼 梁山泊双献头\n第七十四回 燕青智扑擎天柱 李逵寿张乔坐衙\n第七十五回 活阎罗倒船偷御酒 黑旋风扯诏谤�宗\n第七十六回 吴加亮布四斗五方旗 宋公明排九宫八卦阵\n第七十七回 梁山泊十面埋伏 宋公明两赢童贯\n第七十八回 十节度议取梁山泊 宋公明一败高太尉\n第七十九回 刘唐放火烧战船 宋江两败高太尉\n第八十回 张顺凿漏海鳅船 宋江三败高太尉\n第八十一回 燕青月夜遇道君 戴宗定计赚萧让\n第八十二回 梁山泊分金大买市 宋公明全伙受招安\n第八十三回 宋公明奉诏破大辽 陈桥驿滴泪斩小卒\n第八十四回 宋公明兵打蓟州城 卢俊义大战玉田县\n第八十五回 宋公明夜度益津关 吴学究智取文安县\n第八十六回 宋公明大战独鹿山 卢俊义兵陷青石峪\n第八十七回 宋公明大战幽州 呼延灼力擒番将\n第八十八回 颜统军阵列混天象 宋公明梦授玄女法\n第八十九回 宋公明破阵成功 宿太尉颁恩降诏\n第九十回 五台山宋江参禅 双林渡燕青射雁\n第九十一回 张顺夜伏金山寺 宋江智取润州城\n第九十二回 卢俊义分兵宣州道 宋公明大战毗陵郡\n第九十三回 混江龙太湖小结义 宋公明苏州大会垓\n第九十四回 宁海军宋江吊孝 涌金门张顺归神\n第九十五回 张顺魂捉方天定 宋江智取宁海军\n第九十六回 卢俊义分兵歙州道 宋公明大战乌龙岭\n第九十七回 睦州城箭射邓元觉 乌龙岭神助宋公明\n第九十八回 卢俊义大战昱岭关 宋公明智取清溪洞\n第九十九回 鲁智深浙江坐化 宋公明衣锦还乡\n第一百回 宋公明神聚蓼儿洼 徽宗帝梦游梁山泊\n附录 容与堂刻本书前四篇评论文字\n","pages":"768","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s23574262.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s23574262.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s23574262.jpg"},"alt":"https://book.douban.com/subject/1072774/","id":"1072774","publisher":"人民文学出版社","isbn10":"7020015018","isbn13":"9787020015016","title":"水浒传","url":"https://api.douban.com/v2/book/1072774","alt_title":"","author_intro":"","summary":"水浒传，ISBN：9787020015016，作者：施耐庵，出版社：人民文学出版社","series":{"id":"22257","title":"四大名著人文社精装版"},"price":"15.75元"},{"rating":{"max":10,"numRaters":561,"average":"9.2","min":0},"subtitle":"水浒传","author":["施耐庵","罗贯中"],"pubdate":"2009-06","tags":[{"count":153,"name":"古典文学","title":"古典文学"},{"count":110,"name":"四大名著","title":"四大名著"},{"count":106,"name":"施耐庵","title":"施耐庵"},{"count":97,"name":"小说","title":"小说"},{"count":82,"name":"水浒","title":"水浒"},{"count":62,"name":"中国","title":"中国"},{"count":41,"name":"金圣叹","title":"金圣叹"},{"count":41,"name":"中国文学","title":"中国文学"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s3888781.jpg","binding":"平装","translator":[],"catalog":"","pages":"924","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s3888781.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s3888781.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s3888781.jpg"},"alt":"https://book.douban.com/subject/3810699/","id":"3810699","publisher":"中华书局","isbn10":"7101067298","isbn13":"9787101067293","title":"水浒传","url":"https://api.douban.com/v2/book/3810699","alt_title":"","author_intro":"金圣叹：清初著名文学家、文学批评家。他最推崇《离骚》、《庄子》、《史记》、杜诗、《水浒传》、《西厢记》，《水浒传》也就因此被称为《第五才子书》。他的主要成就在于文学批评，对《水浒传》的分析尤其深入独到，堪称最好的评本。\n李卓吾：明代著名的思想家、史学家、文学家。他以其精到独特的见解评点过的《水浒传》仍是现今流行的版本。","summary":"有人说，读《水浒传》不读金圣叹的评语，等于没读过《水浒传》，此言不虚。《水浒传》是一部经过宋、元两代数百年的酝酿、积累而最终完成的长篇历史小说，集合了无数英雄好汉生生死死的悲壮故事、凝聚了无数中国人的理想、感情和才思。明末清初，金圣叹腰斩了一百二十回本的《水浒传》，改原书第一回为\u201c楔子 \u201d，保留原书第七十一回中的\u201c忠义堂石碣受天文\u201d部分，自撰\u201c梁山泊英雄惊噩梦\u201d的情节，作为结局的第七十回。此外还对前七十回的行文做了较多修订，写了大量精彩绝伦的批语，并将这种新版本称为真正的古本。这七十回本一面世，几乎令他本尽废，一统天下近三百年，以至于一般读者只知有七十回的《水浒》了。这也是目前我们这个《四大名著名家点评》本《水浒传》的前七十回；后五十回采自一百二十回本《李卓吾批评忠义水浒传全书》，批评者署名为\u201c李卓吾\u201d。因此，在这个混合的评点本里，读者朋友们既可欣赏到各异其趣的金圣叹和李卓吾评语，也可一窥一百二十回《水浒传》的全貌。\n金圣叹的评点读批《水浒》是中国文学史最具特色的评点之一，远远超过了他之前的李卓吾、叶昼，就连之后毛宗岗、脂砚斋的小说评点，也明显受到了金圣叹评点风格的影响。金圣叹发前人之所未发，提出了一套全新的文学理论批评的观点和方法，总结出诸如草蛇灰线法、绵针泥刺法、獭尾法等全新的创作方法与批评方法。书前的《读第五才子书书法》、每一回的回前评、眉批和错落行间的夹批，值得细细品味，享受阅读最经典小说和最经典评语的愉悦。\n《四大名著名家点评》本《水浒传》，采用大方的16开本，小说原文与点评文字分别以黑色、红色印刷，最大限度地减少了阅读疲劳。另外，中缝处还选配了明代著名版画家陈洪绶绘制的《水浒叶子》精彩人物像十二帧，每十回一帧，依次为：宋江、吴用、武松、李逵、解珍、公孙胜、关胜、林冲、呼延灼、花荣、时迁、鲁智深。","series":{"id":"1321","title":"四大名著名家点评"},"price":"88.00元"},{"rating":{"max":10,"numRaters":973,"average":"9.2","min":0},"subtitle":"","author":["施耐庵"],"pubdate":"2006-6-1","tags":[{"count":460,"name":"金圣叹","title":"金圣叹"},{"count":291,"name":"古典文学","title":"古典文学"},{"count":256,"name":"水浒","title":"水浒"},{"count":158,"name":"金批水浒","title":"金批水浒"},{"count":154,"name":"小说","title":"小说"},{"count":120,"name":"文学","title":"文学"},{"count":120,"name":"批本","title":"批本"},{"count":113,"name":"四大名著","title":"四大名著"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s1843639.jpg","binding":"平装","translator":[],"catalog":"读第五才子书法序一序二序三惯华堂所藏古本《水浒传》前自有序一篇今录之楔子  张天师祈禳瘟疫    洪太尉误走妖魔第一回  王教头私走延安府  九纹龙大闹史家村第二回  史大郎夜走华阴县  鲁提辖拳打镇关西第三回  赵员外重修文殊院  鲁智深大闹五台山第四回  小霸王醉入销金帐  花和尚大闹桃花村第五回  九纹龙翦径赤松林  鲁智深火烧瓦官寺第六回  花和尚倒拔垂杨柳  豹子头误入白虎堂第七回  林教头刺配沧州道  鲁智深大闹野猪林第八回  柴进门招天下客    林冲棒打洪教头第九回  林教头风雪山神庙  陆虞候火烧草料场第十回  朱贵水亭施号箭    林冲雪夜上粱山第十一回  梁山泊林冲落草    汴京城杨志卖刀第十二回  急先锋东郭争功    青面兽北京斗武第十三回  赤发鬼醉卧灵官殿  晁天王认义东溪村第十四回  吴学究说三阮撞筹  公孙胜应七星聚义第十五回  扬志押送金银担    吴用智取生辰纲第十六回  花和尚单打二龙山  青面兽双夺宝珠寺第十七回  美髯公智稳插翅虎  宋公明私放晁天王第十八回  林冲水寨大火并    晁盖梁山小夺泊第十九回  梁山泊义士尊晁盖  郓城县月夜走刘唐第二十回  虔婆醉打唐牛儿    宋江怒杀阎婆惜第二十一回  阎婆大闹郓城县    朱仝义释宋公明第二十二回  横海郡柴进留宾    景阳冈武松打虎第二十三回  王婆贪贿说风情    郓哥不忿闹茶肆第二十四回  王婆计啜西门庆    淫妇药鸩武大郎第二十五回  偷骨殖何九送丧    供人头武二设祭第二十六回  母夜叉孟州道卖人肉    武都头十字坡遇张青第二十七回  武松威震平安寨    施恩义夺快活林第二十八回  施恩重霸孟州道    武松醉打蒋门神第二十九回  施恩三入死囚牢    武松大闹飞云浦第三十回  张都监血溅鸳鸯楼  武行者夜走蜈蚣岭第三十一回  武行者醉打孔亮    锦毛虎义释宋江第三十二回  宋江夜看小鳌山    花荣大闹清风寨第三十三回  镇三山大闹青州道  霹雳火夜走瓦砾场第三十四回  石将军村店寄书    小李广梁山射雁第三十五回  梁山泊吴用举戴宗  揭阳岭宋江逢李俊第三十六回  没遮拦追赶及时雨  船火儿夜闹浔阳江第三十七回  及时雨会神行太保  黑旋风斗浪里白条第三十八回  浔阳楼宋江吟反诗  梁山泊戴宗传假信第三十九回  梁山泊好汉劫法场  白龙庙英雄小聚义第四十回  宋江智取无为军    张顺活捉黄文炳第四十一回  还道村受三卷天书  宋公明遇九天玄女第四十二回  假李逵剪径劫单人  黑旋风沂岭杀四虎第四十三回  锦豹子小径逢戴宗  病关索长街遇石秀第四十四回  杨雄醉骂潘巧云    石秀智杀裴如海第四十五回  病关索大闹翠屏山  拼命三火烧祝家店第四十六回  扑天雕双修生死书  宋公明一打祝家庄第四十七回  一丈青单捉王矮虎  宋公明二打祝家庄第四十八回  解珍解宝双越狱    孙立孙新大劫牢第四十九回  吴学究双掌连环计  宋公明三打祝家庄第五十回  插翅虎枷打白秀英  美髯公误失小衙内第五十一回  李逵打死殷天赐    柴进失陷高唐州第五十二回  戴宗智取公孙胜    李逵斧劈罗真人第五十三回  入云龙斗法破高廉  黑旋风探穴救柴进第五十四回  高太尉大兴三路兵  呼延灼摆布连环马第五十五回  吴用使时迁偷甲    汤隆赚徐宁上山第五十六回  徐宁教使钩镰枪    宋江大破连环马第五十七回  三山聚义打青州    众虎同心归水泊第五十八回  吴用赚金铃吊挂    宋江闹西岳华山第五十九回  公孙胜芒砀山降魔  晁天王曾头市中箭第六十回  吴用智赚玉麒麟    张顺夜闹金沙渡第六十一回  放冷箭燕青救主    劫法场石秀跳楼第六十二回  宋江兵打北京城    关胜议取粱山泊第六十三回  呼延灼月夜赚关胜  宋公明雪天擒索超第六十四回  托塔天王梦中显圣  浪里白条水上报冤第六十五回  时迁火烧翠云楼    吴用智取大名府第六十六回  宋江赏马步三军    关胜降水火二将第六十七回  宋公明夜打曾头市  卢俊义活捉史文恭第六十八回  东平府误陷九纹龙  宋公明义释双枪将第六十九回  没羽箭飞石打英雄  宋公明弃粮擒壮士第七十回  忠义堂石碣受天文  梁山泊英雄排坐次","pages":"804","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s1843639.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s1843639.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s1843639.jpg"},"alt":"https://book.douban.com/subject/1854151/","id":"1854151","publisher":"岳麓书社","isbn10":"7806656707","isbn13":"9787806656709","title":"金圣叹批评本水浒传","url":"https://api.douban.com/v2/book/1854151","alt_title":"","author_intro":"","summary":"古典名著在中国文学史上地位的确立，首先当然是这些名著本身所具有的独特魅力所致，但是也与这些小说刊刻之后，一大批眼光独到的小说批评家们极力批点评说有极大的关系。像李卓吾、金圣叹、毛宗岗、脂砚斋等名字在人们的心目中，就是与《西游记》、《三国演义》、《水浒传》、《红楼梦》密切相连的。他们不仅开创了中国古典小说批评史的新局面，也使更多的读者通过他们的批评更深入地了解了这些古典名著的精髓和魅力。金圣叹腰斩《水浒传》是人们耳熟能详的说法，自从金圣叹推出他的贯华堂本《水浒传》后，有近两百年人们不知道世上还有一百回和一百二十回本的《水浒传》。自郑振铎们挖掘出所谓全本《水浒传》后，金圣叹的七十回本《水浒传》又很少有人见到其庐山真面目了。那么，金圣叹的批评本《水浒传》是不是被腰斩的，他为什么要腰斩《水浒传》，七十回本的《水浒传》和金圣叹的批评究竟是什么样子，他所批评的七十回本《水浒传》究竟有没有独特的魅力。这些问题，相信读者在读完这个批评本之后会找到答案，也会由衷地佩服金圣叹的胆识和才华。而金圣叹那些见解独到、语言独特的批评文字，也会让读者耳目一新。他所提出的人物\"性格\"说，在中国小说批评史上具有独特的地位。","series":{"id":"11717","title":"名著批评本"},"price":"68.00元"},{"rating":{"max":10,"numRaters":715,"average":"8.8","min":0},"subtitle":"","author":["施耐庵、罗贯中\\|校注"],"pubdate":"2005-4","tags":[{"count":199,"name":"四大名著","title":"四大名著"},{"count":104,"name":"施耐庵","title":"施耐庵"},{"count":102,"name":"小说","title":"小说"},{"count":73,"name":"中国文学","title":"中国文学"},{"count":68,"name":"中国古典文学","title":"中国古典文学"},{"count":64,"name":"古典文学","title":"古典文学"},{"count":47,"name":"经典","title":"经典"},{"count":41,"name":"文学","title":"文学"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s6115963.jpg","binding":"","translator":["李永祜 注解"],"catalog":"","pages":"922","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s6115963.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s6115963.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s6115963.jpg"},"alt":"https://book.douban.com/subject/1321547/","id":"1321547","publisher":"中华书局","isbn10":"7101046134","isbn13":"9787101046137","title":"水浒传","url":"https://api.douban.com/v2/book/1321547","alt_title":"","author_intro":"","summary":"《水浒传》的思想成就和艺术精华主要体现在前七十回之中，作者生动描绘众多英雄好汉，尤其是宋江、林冲、武松和鲁智深、李逵、杨志等人被迫落草、逼上梁山的曲折历程，揄扬以宋江为首的绿林好汉\u201c八方共域，异姓一家\u201d，团结一致\u201c替天行道，保境安民\u201d，同时又打家劫寨，劫富济贫的侠义精神。","price":"29.00元"},{"rating":{"max":10,"numRaters":114,"average":"9.6","min":0},"subtitle":"","author":["(明)施耐庵","(清)金圣叹"],"pubdate":"2010-4","tags":[{"count":59,"name":"金圣叹","title":"金圣叹"},{"count":38,"name":"水浒传","title":"水浒传"},{"count":36,"name":"古典文学","title":"古典文学"},{"count":23,"name":"文学","title":"文学"},{"count":17,"name":"批评","title":"批评"},{"count":16,"name":"小说","title":"小说"},{"count":12,"name":"明清小说","title":"明清小说"},{"count":9,"name":"我也是读过名著的人","title":"我也是读过名著的人"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s6182978.jpg","binding":"平装","translator":[],"catalog":"序一序二序三宋史纲宋史目读第五才子书法贯华堂所藏古本《水浒传》前自有序一篇今录之楔子  张天师祈禳瘟疫  洪太尉误走妖魔第一回  王教头私走延安府  九纹龙大闹史家村第二回  史大郎夜走华阴县  鲁提辖拳打镇关西第三回  赵员外重修文殊院  鲁智深大闹五台山第四回  小霸王醉入销金帐  花和尚大闹桃花村第五回  九纹龙翦径赤松林  鲁智深火烧瓦官寺第六回  花和尚倒拔垂杨柳  豹子头误入白虎堂第七回  林教头刺配沧州道  鲁智深大闹野猪林第八回  柴进门招天下客  林冲棒打洪教头第九回  林教头风雪山神庙  陆虞候火烧草料场第十回  朱贵水亭施号箭  林冲雪夜上粱山第十一回  梁山泊林冲落草  汴京城杨志卖刀第十二回  急先锋东郭争功  青面兽北京斗武第十三回  赤发鬼醉卧灵官殿  晁天王认义东溪村第十四回  吴学究说三阮撞筹  公孙胜应七星聚义第十五回  扬志押送金银担  吴用智取生辰纲第十六回  花和尚单打二龙山  青面兽双夺宝珠寺第十七回  美髯公智稳插翅虎  宋公明私放晁天王第十八回  林冲水寨大火并  晁盖梁山小夺泊第十九回  梁山泊义士尊晁盖  郓城县月夜走刘唐第二十回  虔婆醉打唐牛儿  宋江怒杀阎婆惜第二十一回  阎婆大闹郓城县  朱仝义释宋公明第二十二回  横海郡柴进留宾  景阳冈武松打虎第二十三回  王婆贪贿说风情  郓哥不忿闹茶肆第二十四回  王婆计啜西门庆  淫妇药鸩武大郎第二十五回  偷骨殖何九送丧  供人头武二设祭第二十六回  母夜叉孟州道卖人肉  武都头十字坡遇张青第二十七回  武松威震平安寨  施恩义夺快活林第二十八回  施恩重霸孟州道  武松醉打蒋门神第二十九回  施恩三入死囚牢  武松大闹飞云浦第三十回  张都监血溅鸳鸯楼  武行者夜走蜈蚣岭第三十一回  武行者醉打孔亮  锦毛虎义释宋江第三十二回  宋江夜看小鳌山  花荣大闹清风寨第三十三回  镇三山大闹青州道  霹雳火夜走瓦砾场第三十四回  石将军村店寄书  小李广梁山射雁第三十五回  梁山泊吴用举戴宗  揭阳岭宋江逢李俊第三十六回  没遮拦追赶及时雨  船火儿夜闹浔阳江第三十七回  及时雨会神行太保  黑旋风斗浪里白条第三十八回  浔阳楼宋江吟反诗  梁山泊戴宗传假信第三十九回  梁山泊好汉劫法场  白龙庙英雄小聚义第四十回  宋江智取无为军  张顺活捉黄文炳第四十一回  还道村受三卷天书  宋公明遇九天玄女第四十二回  假李逵剪径劫单人  黑旋风沂岭杀四虎第四十三回  锦豹子小径逢戴宗  病关索长街遇石秀第四十四回  杨雄醉骂潘巧云  石秀智杀裴如海第四十五回  病关索大闹翠屏山  拼命三火烧祝家店第四十六回  扑天雕双修生死书  宋公明一打祝家庄第四十七回  一丈青单捉王矮虎  宋公明二打祝家庄第四十八回  解珍解宝双越狱  孙立孙新大劫牢第四十九回  吴学究双掌连环计  宋公明三打祝家庄第五十回  插翅虎枷打白秀英  美髯公误失小衙内第五十一回  李逵打死殷天赐  柴进失陷高唐州第五十二回  戴宗智取公孙胜  李逵斧劈罗真人第五十三回  入云龙斗法破高廉  黑旋风探穴救柴进第五十四回  高太尉大兴三路兵  呼延灼摆布连环马第五十五回  吴用使时迁偷甲  汤隆赚徐宁上山第五十六回  徐宁教使钩镰枪  宋江大破连环马第五十七回  三山聚义打青州  众虎同心归水泊第五十八回  吴用赚金铃吊挂  宋江闹西岳华山第五十九回  公孙胜芒砀山降魔  晁天王曾头市中箭第六十回  吴用智赚玉麒麟  张顺夜闹金沙渡第六十一回  放冷箭燕青救主  劫法场石秀跳楼第六十二回  宋江兵打北京城  关胜议取粱山泊第六十三回  呼延灼月夜赚关胜  宋公明雪天擒索超第六十四回  托塔天王梦中显圣  浪里白条水上报冤第六十五回  时迁火烧翠云楼  吴用智取大名府第六十六回  宋江赏马步三军  关胜降水火二将第六十七回  宋公明夜打曾头市  卢俊义活捉史文恭第六十八回  东平府误陷九纹龙  宋公明义释双枪将第六十九回  没羽箭飞石打英雄  宋公明弃粮擒壮士第七十回  忠义堂石碣受天文  梁山泊英雄排坐次","pages":"646","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s6182978.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s6182978.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s6182978.jpg"},"alt":"https://book.douban.com/subject/4866956/","id":"4866956","publisher":"凤凰出版社","isbn10":"7807297239","isbn13":"9787807297239","title":"金圣叹批评本水浒传（上下）","url":"https://api.douban.com/v2/book/4866956","alt_title":"","author_intro":"","summary":"《金圣叹批评本水浒传(套装上下册)》以民国23年上海中华书局影印刘复藏明崇祯贯华堂刻《第五才．子书施耐庵水浒传》为底本，以1975年北京中华书局影印叶瑶池重刻《第五才子书施耐庵水浒传》、清坊刻王望如评论《贯华堂第五才子书》为参校。个别正文，据明容与堂刻《水浒传》校改。为适合当今读者阅读习惯，《金圣叹批评本水浒传(套装上下册)》配以绣像插图，图文并茂，以增添审美愉悦。","series":{"id":"20944","title":"名家批评本名著"},"price":"60.00元"},{"rating":{"max":10,"numRaters":136,"average":"8.4","min":0},"subtitle":"怎样的强盗书","author":["孙述宇"],"pubdate":"2011-3","tags":[{"count":71,"name":"水浒传","title":"水浒传"},{"count":44,"name":"古典文学","title":"古典文学"},{"count":39,"name":"文学研究","title":"文学研究"},{"count":32,"name":"文学","title":"文学"},{"count":23,"name":"文学批评","title":"文学批评"},{"count":21,"name":"历史","title":"历史"},{"count":19,"name":"孙述宇","title":"孙述宇"},{"count":17,"name":"文学评论","title":"文学评论"}],"origin_title":"水浒传的来历、心态与艺术","image":"https://img3.doubanio.com/view/subject/m/public/s6636682.jpg","binding":"平装","translator":[],"catalog":"自   序  / 1\n导   言  / 1\n第一部   《水浒传》的来历\n第一章   《水浒传》：强人说给强人听的故事？  / 18\n一、怎样的强盗书？  / 18\n二、杀人越货  / 19\n三、女人祸水  / 24\n四、骨肉同心  / 29\n五、江湖义气  / 31\n六、亡命汉的脸孔  / 34\n第二章   南宋民众抗敌与梁山英雄报国  / 36\n一、是真实还是虚构的故事？  / 36\n二、两宋之际的军贼  / 38\n三、敌前敌后的自卫武装  / 53\n四、岳飞的复国方略  / 73\n五、历史在小说里  / 89\n六、小说如何写成  / 97\n第三章   梁山好汉归顺朝廷的意义  / 110\n一、《水浒传》中的神话：\u201c宋朝必显忠良\u201d  / 110\n二、《水浒传》的来历  / 114\n第四章   曾头市与晁天王  / 119\n一、喻言影射  / 119\n二、\u201c靖康耻\u201d  / 120\n三、《水浒传》独有的故事  / 124\n第五章   忠义堂为什么建在梁山上？  / 126\n一、宋江曾驻在梁山上？  / 126\n二、抗金圣地  / 129\n三、《水浒传》的地域起源  / 132\n第六章   《水浒传》与道教  / 136\n一、袒道仇僧  / 136\n二、暧昧的原因  / 140\n三、道教的哪一派？  / 144\n第七章   卅六人故事的演进  / 150\n一、总结  / 150\n二、宣和盗、忠义人、《水浒传》  / 150\n三、分支：太行山与梁山泊  / 152\n四、创作的年代  / 156\n第二部   《水浒》内外的人与事\n第一章   岳飞  / 166\n第二章   宋江  / 175\n第三章   燕青与卢俊义  / 182\n第四章   关胜与林冲  / 185\n第五章   生辰纲、大名府、李天王、闻大刀  / 191\n第六章   鲁智深与五台僧  / 195\n第七章   呼延灼与杨志  / 202\n第八章   一丈青扈三娘  / 210\n第九章   玄女娘娘  / 215\n第三部   心态与艺术\n第一章   江湖上的义气  / 220\n一、滑溜溜的字  / 220\n二、不同的意思  / 221\n三、小说中的运用  / 223\n四、宣传家的手笔  / 229\n第二章   红颜祸水  / 233\n一、女性的描绘  / 233\n二、祸水  / 237\n三、新的英雄  / 240\n四、梁山上的性生活  / 243\n五、为亡命行动服务的艺术  / 246\n第三章   家室之累  / 251\n第四章   大碗酒、大块肉  / 257\n一、湿淋淋肥腻腻的故事  / 257\n二、英雄之量  / 258\n三、享受的意义  / 261\n四、智多星的煽动方法  / 264\n第五章   黄金若粪土？  / 267\n一、没钱的不是好汉  / 267\n二、不是侠盗  / 268\n三、疏财仗义的道理  / 270\n四、最动人的数量  / 273\n第六章   有仇不报非丈夫  / 277\n一、究竟有多么残酷？  / 277\n二、睚眦必报  / 281\n三、大丈夫的身价  / 283\n附   录\n附录一   龚开《宋江三十六赞》  / 288\n附录二   《大宋宣和遗事》中的水浒故事片段  / 292\n附录三   元代水浒杂剧摘要  / 298\n本书所引书籍论文举要  / 301\n重要项目索引  / 306","pages":"310","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s6636682.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s6636682.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s6636682.jpg"},"alt":"https://book.douban.com/subject/6105383/","id":"6105383","publisher":"上海古籍出版社","isbn10":"7532557685","isbn13":"9787532557684","title":"水浒传：怎样的强盗书","url":"https://api.douban.com/v2/book/6105383","alt_title":"水浒传的来历、心态与艺术","author_intro":"孙述宇，1934年生，原籍广东中山。抗战时期在西南大后方读小学，胜利后回广州读中学，解放后，曾北上学习自然科学，其后去香港，毕业于新亚书院外文系，继在美国耶鲁大学英文系得到博士学位。长期任教于香港中文大学，授课跨英文、翻译及中文各系，亦曾在美国爱荷华州立大学远东系及台湾中山大学、成功大学等校外文系任教。著述范围为中国旧小说及古代英语与英语语音演变等。","summary":"本书是对《水浒传》的故事来历、创作心态与小说艺术的研究与探讨。第一部分《〈水浒传〉的来历》阐释该书是一本创作与流传在法外强徒之间的小说，并且这套故事与岳飞及当年的抗金忠义人有着密切的联系；第二部分《〈水浒〉内外的人与事》是讨论小说中的人物、地方、事件与真实历史和地理的关系；第三部分谈的是《水浒传》所反映出的典型的强人心态，如重视同道中人的义气，对女性的放闲心理，强调复仇等等，并对小说的艺术特点进行了精心的赏鉴。由于作者少年时期熟读旧小说，后又长期淫浸于西方文学的研究，学养丰厚，文笔优美，是一本极具可读性的小说研究、赏析的上乘之作。","price":"32.00元"},{"rating":{"max":10,"numRaters":191,"average":"9.3","min":0},"subtitle":"","author":["[明]施耐庵著","[清]金圣叹评","刘一舟校点"],"pubdate":"1991年1月第1版","tags":[{"count":98,"name":"金圣叹","title":"金圣叹"},{"count":70,"name":"水浒","title":"水浒"},{"count":46,"name":"古典名著","title":"古典名著"},{"count":31,"name":"古典文学","title":"古典文学"},{"count":28,"name":"小说","title":"小说"},{"count":27,"name":"施耐庵","title":"施耐庵"},{"count":24,"name":"文学","title":"文学"},{"count":18,"name":"中国文学","title":"中国文学"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s26167130.jpg","binding":"精装","translator":[],"catalog":"\n      ","pages":"1922","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s26167130.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s26167130.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s26167130.jpg"},"alt":"https://book.douban.com/subject/1647089/","id":"1647089","publisher":"齐鲁书社","isbn10":"7533301838","isbn13":"9787533301835","title":"金圣叹批评水浒传（全二册）","url":"https://api.douban.com/v2/book/1647089","alt_title":"","author_intro":"","summary":"《水浒传》是民间无名作者同文人作家集体创作的成果，其成书经历了一个漫长的流传演变过程。《水浒传》描写的以宋江为首的农民起义发生在宋徽宗宣和年间(1119～1126)，因声势极盛，便在民间产生许多奇闻异说，流传中不断得到无名作者的加工增饰。施耐庵就是在长期民间传说、民间说话艺术和元杂剧水浒戏的基础上加工写定成书的。","series":{"id":"4279","title":"明代四大奇书"},"price":"72.0"},{"rating":{"max":10,"numRaters":429,"average":"8.6","min":0},"subtitle":"","author":["施耐庵著"],"pubdate":"2006-7","tags":[{"count":78,"name":"四大名著","title":"四大名著"},{"count":43,"name":"古典名著","title":"古典名著"},{"count":40,"name":"小说","title":"小说"},{"count":37,"name":"水浒传","title":"水浒传"},{"count":34,"name":"古典文学","title":"古典文学"},{"count":31,"name":"经典","title":"经典"},{"count":22,"name":"中国","title":"中国"},{"count":14,"name":"文学","title":"文学"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s10432900.jpg","binding":"平装","translator":[],"catalog":"引首\n第一回　张天师祈禳瘟疫　　洪太尉误走妖魔\n第二回　王教头私走延安府　九纹龙大闹史家村\n第三回　史大郎夜走华阴县　鲁提辖拳打镇关西\n第四回　赵员外重修文殊院　鲁智深大闹五台山\n第五回　小霸王醉入销金帐　花和尚大闹桃花村\n第六回　九纹龙剪径赤松林　鲁智深火烧瓦罐寺\n第七回　花和尚倒拔垂杨柳　豹子头误入白虎堂\n第八回　林教头刺配沧州道　鲁智深大闹野猪林\n第九回　柴进门招天下客　　林冲棒打洪教头\n第十回　林教头风雪山神庙　陆虞候火烧草料场\n第十一回　朱贵水亭施号箭　　林冲雪夜上梁山\n第十二回　梁山泊林冲落草　　汴京城杨志卖刀\n第十三回　急先锋东郭争功　　青面兽北京斗武\n第十四回　赤发鬼醉卧灵官殿　晁天王认义东溪村\n第十五回　吴学究说三阮撞筹　公孙胜应七星聚义\n第十六回　杨志押送金银担　　吴用智取生辰纲\n第十七回　花和尚单打二龙山　青面兽双夺宝珠寺\n第十八回　美髯公智稳插翅虎　宋公明私放晁天王\n第十九回　林冲水寨大并火　　晁盖梁山小夺泊\n第二十回　梁山泊义士尊晁盖　郓城县月夜走刘唐\n第二十一回　虔婆醉打唐牛儿　　宋汀怒杀阎婆惜\n第二十二回　阎婆大闹郓城县　　朱仝义释宋公明\n第二十三回　横海郡柴进留宾　　景阳冈武松打虎\n第二十四回　王婆贪贿说风情　　郓哥不忿闹茶肆\n第二十五回　王婆计啜西门庆　　淫妇药鸩武大郎\n第二十六回　郓哥大闹授官厅　　武松斗杀西门庆\n第二十七回　母夜叉孟州卖人肉武都头十字坡遇张青\n第二十八回　武松威镇安平寨　　施恩义夺快活林\n第二十九回　施恩重霸孟州道　　武松醉打蒋门神\n第三 十 回　施恩三入死囚牢　　武松大闹飞云浦\n第三十一回　张都监血溅鸳鸯楼　武行者夜走蜈蚣岭\n第三十二回　武行者醉打孔亮　　锦毛虎义释宋江\n第三十三回　宋江夜看小鳌山　　花荣大闹清风寨\n第三十四回　镇三山大闹青州道　霹雳火夜走瓦砾场\n第三十五回　石将军村店寄书　　小李广梁山射雁\n第三十六回　梁山泊吴用举戴宗　揭阳岭宋江逢李俊\n第三十七回　没遮拦追赶及时雨　船火儿夜闹浔阳江\n第三十八回　及时雨会神行太保　黑旋风斗浪里白跳\n第三十九回　浔阳楼宋江吟反诗　梁山泊戴宗传假信\n第四 十 回　梁山泊好汉劫法场　白龙庙英雄小聚义\n第四十一回　宋江智取无为军　　张顺活捉黄文炳\n第四十二回　还道村受三卷天书　宋公明遇九天玄女\n第四十三回　假李逵剪径劫单人　黑旋风沂岭杀四虎\n第四十四回　锦豹子小径逢戴宗　病关索长街遇石秀\n第四十五回　杨雄醉骂潘巧云　　石秀智杀裴如海\n第四十六回　病关索大闹翠屏山　拼命三火烧祝家庄\n第四十七回　扑天雕双修生死书　宋公明一打祝家庄\n第四十八回　一丈青单捉王矮虎　宋公明两打祝家庄\n第四十九回　解珍解宝双越狱　　孙立孙新大劫牢\n第五 十 回　吴学究双用连环计　宋公明三打祝家庄\n第五十一回　插翅虎枷打白秀英　美髯公误失小衙内\n第五十二回　李逵打死殷天锡　　柴进失陷高唐州\n第五十三回　戴宗智取公孙胜　　李逵斧劈罗真人\n第五十四回　入云龙斗法破高廉　黑旋风探穴救柴进\n第五十五回　高太尉大兴三路兵　呼延灼摆布连环马\n第五十六回　吴用使时迁盗甲　　汤隆赚徐宁上山\n第五十七回　徐宁教使钩镰枪　　宋汀大破连环马\n第五十八回　三山聚义打青州　　众虎同心归水泊\n第五十九回　吴用赚金铃吊挂　　宋江闹西岳华山\n第六 十 回　公孙胜芒砀山降魔　晁天王曾头市中箭\n第六十一回　吴用智赚玉麒麟　　张顺夜闹金沙渡\n第六十二回　放冷箭燕青救主　　劫法场石秀跳楼\n第六十三回　宋汀兵打北京城　　关胜议取梁山泊\n第六十四回　呼延灼夜月赚关胜　宋公明雪天擒索超\n第六十五回　托塔天王梦中显圣　浪里白跳水上报冤\n第六十六回　时迁火烧翠云楼　　吴用智取大名府\n第六十七回　宋江赏马步三军　　关胜降水火二将\n第六十八回　宋公明夜打曾头市　卢俊义活捉史文恭\n第六十九回　东平府误陷九纹龙　宋公明义释双枪将\n第七 十 回　没羽箭飞石打英雄　宋公明弃粮擒壮士\n第七十一回　忠义堂石碣受天文　梁山泊英雄排座次\n第七十二回　柴进簪花入禁院　　李逵元夜闹东京\n第七十三回　黑旋风乔捉鬼　　梁山泊双献头\n第七十四回　燕青智扑擎天柱　　李逵寿张乔坐衙\n第七十五回　活阎罗倒船偷御酒　黑旋风扯诏谤徽宗\n第七十六回　吴加亮布四斗五方旗宋公明排九宫八卦阵\n第七十七回　梁山泊十面埋伏　　宋公明两赢童贯\n第七十八回　十节度议取梁山泊　宋公明一败高太尉\n第七十九回　刘唐放火烧战船　　宋江两败高太尉\n第八 十 回　张顺凿漏海鳅船　　宋江三败高太尉\n第八十一回　燕青月夜遇道君　　戴宗定计出乐和\n第八十二回　梁山泊分金大买市　宋公明全伙受招安\n第八十三回　宋公明奉诏破大辽　陈桥驿滴泪斩小卒\n第八十四回　宋公明兵打蓟州城　卢俊义大战玉田县\n第八十五回　宋公明夜度益津关　吴学究智取文安县\n第八十六回 宋公明大战独鹿山　卢俊义兵陷青石峪\n第八十七回　宋公明大战幽州　　呼延灼力擒番将\n第八十八回　颜统军阵列混天象　宋公明梦授玄女法\n第八十九回　宋公明破阵成功　　宿太尉颁恩降诏\n第九 十 回　五台山宋江参禅　　双林渡燕青射雁\n第九十一回　张顺夜伏金山寺　　宋汀智取润州城\n第九十二回　卢俊义分兵宣州道　宋公明大战毗陵郡\n第九十三回　混江龙太湖小结义　宋公明苏州大会垓\n第九十四回　宁海军宋江吊孝　　涌金门张顺归神\n第九十五回　张顺魂捉方天定　　宋江智取宁海军\n第九十六回　卢俊义分兵歙州道　宋公明大战乌龙岭\n第九十七回　睦州城箭射邓元觉　乌龙岭神助宋公明\n第九十八回　卢俊义大战昱岭关　宋公明智取清溪洞\n第九十九回　鲁智深浙汀坐化　　宋公明衣锦还乡\n第一 百 回　宋公明神聚蓼儿洼　徽宗帝梦游梁山泊","pages":"447","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s10432900.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s10432900.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s10432900.jpg"},"alt":"https://book.douban.com/subject/1881676/","id":"1881676","publisher":"北京出版社","isbn10":"7200065102","isbn13":"9787200065107","title":"水浒传","url":"https://api.douban.com/v2/book/1881676","alt_title":"","author_intro":"","summary":"《水浒传》是我国人民最喜爱的古典长篇白话小说之一。全书以宋江领导的农民起义为主要题材，艺术地再现了中国古代人民反抗压迫、英勇斗争的悲壮画卷。作品充分暴露了封建统治阶级的腐朽和残暴，揭露了当时尖锐对立的社会矛盾和\u201c官逼民反\u201d的残酷现实，成功地塑造了鲁智深、李逵、武松、林冲、阮小七等一批英雄人物。《水浒传》为\u201c家庭书架\u201d从书之一，表现了一群不堪暴政欺压的\u201c好汉\u201d揭竿而起，聚义水泊梁山，直至接受朝廷招安而失败的全过程。","series":{"id":"10592","title":"家庭书架·传世经典读库"},"price":"19.90元"},{"rating":{"max":10,"numRaters":148,"average":"8.3","min":0},"subtitle":"水浒传","author":["施耐庵"],"pubdate":"2004-4","tags":[{"count":33,"name":"小说","title":"小说"},{"count":26,"name":"四大名著","title":"四大名著"},{"count":23,"name":"施耐庵","title":"施耐庵"},{"count":20,"name":"古典文学","title":"古典文学"},{"count":14,"name":"古典","title":"古典"},{"count":12,"name":"水浒传","title":"水浒传"},{"count":10,"name":"中国文学","title":"中国文学"},{"count":9,"name":"中国古典","title":"中国古典"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s6458459.jpg","binding":"","translator":[],"catalog":"\n      ","pages":"1040","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s6458459.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s6458459.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s6458459.jpg"},"alt":"https://book.douban.com/subject/1160780/","id":"1160780","publisher":"上海古籍出版社","isbn10":"7532536890","isbn13":"9787532536894","title":"水浒传","url":"https://api.douban.com/v2/book/1160780","alt_title":"","author_intro":"","summary":"《水浒传》具体而生动地描写了以宋江为首的农民起义发生、发展直至失财的整个过程，揭露了封建社会的黑暗、腐朽和统治阶级的种种罪恶，热情歌颂了起义英雄的反抗精神和正义行动，塑造了一大批梁山好汉的光辉形象，形象地揭示了封建社会\u201c官逼民反\u201d的客观真理和农民起义失败的内在原因。","price":"19.50元"},{"rating":{"max":10,"numRaters":310,"average":"8.5","min":0},"subtitle":"","author":["施耐庵","罗贯中"],"pubdate":"1997-1-1","tags":[{"count":57,"name":"小说","title":"小说"},{"count":49,"name":"中国文学","title":"中国文学"},{"count":43,"name":"古典名著","title":"古典名著"},{"count":24,"name":"施耐庵","title":"施耐庵"},{"count":24,"name":"中国","title":"中国"},{"count":22,"name":"古典文学","title":"古典文学"},{"count":19,"name":"水浒传","title":"水浒传"},{"count":13,"name":"古典","title":"古典"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s9140518.jpg","binding":"平装","translator":[],"catalog":"引首\n第一回 张天师祈禳瘟疫 洪太尉误走妖魔\n第二回 王教头私走延安府 九纹龙大闹史家村\n第三回 史大朗夜走华阴县 鲁提辖拳打镇关西\n第四回 赵员外重修文殊院 鲁智深大闹五台山\n第五回 小霸王醉入销金帐 花和尚大闹桃花村\n第六回 九纹龙剪径赤松林 鲁智深火烧瓦罐寺\n第七回 花和尚倒拔垂杨柳 豹子头误入白虎堂\n第八回 林教头刺配沧州道 鲁智深大闹野猪林\n第九回 柴进门招天下客 林冲棒打洪教头\n第十回 林教头风雪山神庙 陆虞候火烧草料场\n\u2026\u2026","pages":"1336","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s9140518.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s9140518.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s9140518.jpg"},"alt":"https://book.douban.com/subject/1028122/","id":"1028122","publisher":"人民文学出版社","isbn10":"7020031951","isbn13":"9787020031955","title":"水浒传(上、下)","url":"https://api.douban.com/v2/book/1028122","alt_title":"","author_intro":"","summary":"《水浒传》具体而生动地描写了以宋江为首的农民起义发生、发展直至失财的整个过程，揭露了封建社会的黑暗、腐朽和统治阶级的种种罪恶，热情歌颂了起义英雄的反抗精神和正义行动，塑造了一大批梁山好汉的光辉形象，形象地揭示了封建社会\u201c官逼民反\u201d的客观真理和农民起义失败的内在原因。","series":{"id":"4492","title":"中学生课外文学名著必读"},"price":"46.00"},{"rating":{"max":10,"numRaters":103,"average":"8.6","min":0},"subtitle":"水浒传","author":["施耐庵"],"pubdate":"2006-3","tags":[{"count":22,"name":"四大名著","title":"四大名著"},{"count":14,"name":"施耐庵","title":"施耐庵"},{"count":13,"name":"古典文学","title":"古典文学"},{"count":13,"name":"古典四大名著","title":"古典四大名著"},{"count":9,"name":"小说","title":"小说"},{"count":7,"name":"文学","title":"文学"},{"count":6,"name":"古典小说","title":"古典小说"},{"count":6,"name":"古典","title":"古典"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s8847189.jpg","binding":"简裝本","translator":[],"catalog":"引首第一回  张天师祈禳瘟疫  洪太尉误走妖魔第二回  王教头私走延安府  九纹龙大闹史家村第三回  史大郎夜走华阴县  鲁提辖拳打镇关西第四回  赵员外重修文殊院  鲁智深大闹五台山第五回  小霸王醉入销金帐  花和尚大闹桃花村第六回  九纹龙剪径赤松林  鲁智深火烧瓦罐寺第七回  花和尚倒拔垂杨柳  豹子头误入白虎堂第八回  林教头刺配沧州道  鲁智深大闹野猪林第九回  柴进门招天下客  林冲棒打洪教头第十回  林教头风雪山神庙  陆虞候火烧草料场第十一回  朱贵水亭施号箭  林冲雪夜上梁山第十二回  梁山泊林冲落草  汴京城杨志卖刀第十三回  急先锋东郭争功  青面兽北京斗武第十四回  赤发鬼醉卧灵官殿  晁天王认义东溪村第十五回  吴学究说三阮撞筹  公孙胜应七星聚义第十六回  杨志押送金银担  吴用智取生辰纲第十七回  花和尚单打二龙山  青面兽双夺宝珠寺第十八回  美髯公智稳插翅虎  宋公明私放晁天王第十九回  林冲水寨大并火  晁盖梁山小夺泊第二十回  梁山泊义士尊晁盖  郓城县月夜走刘唐第二十一回  虔婆醉打唐牛儿  宋江怒杀阎婆惜第二十二回  阎婆大闹郓城县  朱全义释宋公明第二十三回  横海郡柴进留宾  景阳冈武松打虎第二十四回  王婆贪贿说风情  郓哥不忿闹茶肆第二十五回  王婆计啜西门庆  淫妇药鸩武大郎第二十六回  郓哥大闹授官厅  武松斗杀西门庆第二十七回  母夜叉孟州道卖人肉  武都头十字坡遇张青第二十八回  武松威镇安平寨  施恩义夺快活林第二十九回  施恩重霸孟州道  武松醉打蒋门神第三十回    施恩三入死囚牢  武松大闹飞云浦第三十一回  张都监血溅鸳鸯楼  武行者夜走蜈蚣岭第三十二回  武行者醉打孔亮  锦毛虎义释宋江第三十三回  宋江夜看小鳌山  花荣大闹清风寨第三十四回  镇三山大闹青州道  霹雳火夜走瓦砾场第三十五回  石将军村店寄书  小李广梁山射雁第三十六回  梁山泊吴用举戴宗  揭阳岭宋江逢李俊第三十七回  没遮拦追赶及时雨  船火儿夜闹浔阳江第三十八回  及时雨会神行太保  黑旋风斗浪里白跳第三十九回  浔阳楼宋江吟反诗  梁山泊戴宗传假信第四十回    梁山泊好汉劫法场  白龙庙英雄小聚义第四十一回  宋江智取无为军  张顺活捉黄文炳第四十二回  还道村受三卷天书  宋公明遇九天玄女第四十三回  假李逵剪径劫单人  黑旋风沂岭杀四虎第四十四回  锦豹子小径逢戴宗  病关索长街遇石秀第四十五回  杨雄醉骂潘巧云  石秀智杀裴如海第四十六回  病关索大闹翠屏山  拚命三火烧祝家庄第四十七回  扑天雕双修生死书  宋公明一打祝家庄第四十八回  一丈青单捉王矮虎  宋公明两打祝家庄第四十九回  解珍解宝双越狱  孙立孙新大劫牢第五十回    吴学究双用连环计  宋公明三打祝家庄第五十一回  插翅虎枷打白秀英  美髯公误失小衙内第五十二回  李逵打死殷天锡  柴进失陷高唐州第五十三回  戴宗智取公孙胜  李逵斧劈罗真人第五十四回  入云龙斗法破高廉  黑旋风探穴救柴进第五十五回  高太尉大兴三路兵  呼延灼摆布连环马第五十六回  吴用使时迁盗甲  汤隆赚徐宁上山第五十七回  徐宁教使钩镰枪  宋江大破连环马第五十八回  三山聚义打青州  众虎同心归水泊第五十九回  吴用赚金铃吊挂  宋江闹西岳华山第六十回    公孙胜芒砀山降魔  晁天王曾头市中箭第六十一回  吴用智赚玉麒麟  张顺夜闹金沙渡第六十二回  放冷箭燕青救主  劫法场石秀跳楼第六十三回  宋江兵打北京城  关胜议取梁山泊第六十四回  呼延灼夜月赚关胜  宋公明雪天擒索超第六十五回  托塔天王梦中显圣  浪里白跳水上报冤第六十六回  时迁火烧翠云楼  吴用智取大名府第六十七回  宋江赏马步三军  关胜降水火二将第六十八回  宋公明夜打曾头市  卢俊义活捉史文恭第六十九回  东平府误陷九纹龙  宋公明义释双枪将第七十回    没羽箭飞石打英雄  宋公明弃粮擒壮士第七十一回  忠义堂石碣受天文  梁山泊英雄排座次第七十二回  柴进簪花入禁院  李逵元夜闹东京第七十三回  黑旋风乔捉鬼  梁山泊双献头第七十四回  燕青智扑擎天柱  李逵寿张乔坐衙第七十五回  活阎罗倒船偷御酒  黑旋风扯诏谤徽宗第七十六回  吴加亮布四斗五方旗  宋公明排九宫八卦阵第七十七回  梁山泊十面埋伏  宋公明两赢童贯第七十八回  十节度议取梁山泊  宋公明一败高太尉第七十九回  刘唐放火烧战船  宋江两败高太尉第八十回    张顺凿漏海鳅船  宋江三败高太尉第八十一回  燕青月夜遇道君  戴宗定计赚萧让第八十二回  梁山泊分金大买市  宋公明全伙受招安第八十三回  宋公明奉诏破大辽  陈桥驿滴泪斩小卒第八十四回  宋公明兵打蓟州城  卢俊义大战玉田县第八十五回  宋公明夜度益津关  吴学究智取文安县第八十六回  宋公明大战独鹿山  卢俊义兵陷青石峪第八十七回  宋公明大战幽州  呼延灼力擒番将第八十八回  颜统军阵列混天象  宋公明梦授玄女法第八十九回  宋公明破阵成功  宿太尉颁恩降诏第九十回    五台山宋江参禅  双林渡燕青射雁第九十一回  张顺夜伏金山寺  宋江智取润州城第九十二回  卢俊义分兵宣州道  宋公明大战毗陵郡第九十三回  混江龙太湖小结义  宋公明苏州大会垓第九十四回  宁海军宋江吊孝  涌金门张顺归神第九十五回  张顺魂捉方天定  宋江智取宁海军第九十六回  卢俊义分兵歙州道  宋公明大战乌龙岭第九十七回  睦州城箭射邓元觉  乌龙岭神助宋公明第九十八回  卢俊义大战昱岭关  宋公明智取清溪洞第九十九回  鲁智深浙江坐化  宋公明衣锦还乡第一百回    宋公明神聚蓼儿洼  徽宗帝梦游梁山泊","pages":"961","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s8847189.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s8847189.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s8847189.jpg"},"alt":"https://book.douban.com/subject/1810965/","id":"1810965","publisher":"金盾","isbn10":"7508238923","isbn13":"9787508238920","title":"水浒传","url":"https://api.douban.com/v2/book/1810965","alt_title":"","author_intro":"","summary":"《水浒传》是我国人民最喜爱的古典长篇白话小说之一。它产生于明代，是在宋、元以来有关水浒的故事、话本、戏曲的基础上，由作者加工整理、创作而成的。《水浒传》以宋江领导的农民起义为主要题材，艺术地再现了中国古代人民反抗压迫、英勇斗争的悲壮画卷。作品充分暴露了封建统治阶级的腐朽和残暴，揭露了当时尖锐对立的社会矛盾和\u201c官逼民反\u201d的残酷现实，成功地塑造了鲁智深、李逵、武松、林冲、阮小七等一批英雄人物。小说故事情节曲折，语言生动，人物性格鲜明，具有高度的艺术成就。但作品歌颂、美化宋江，鼓吹\u201c忠义\u201d和\u201c替天行道\u201d，表现出严重的思想局限。","price":"22.50元"},{"rating":{"max":10,"numRaters":56,"average":"9.3","min":0},"subtitle":"","author":["施耐庵 罗贯中"],"pubdate":"2012-3","tags":[{"count":19,"name":"水浒传","title":"水浒传"},{"count":16,"name":"古典文学","title":"古典文学"},{"count":12,"name":"四大名著","title":"四大名著"},{"count":10,"name":"小说","title":"小说"},{"count":8,"name":"中国古典文学","title":"中国古典文学"},{"count":7,"name":"施耐庵","title":"施耐庵"},{"count":6,"name":"古典","title":"古典"},{"count":5,"name":"李卓吾","title":"李卓吾"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s2923270.jpg","binding":"精装","translator":[],"catalog":"\n      ","pages":"1489","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s2923270.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s2923270.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s2923270.jpg"},"alt":"https://book.douban.com/subject/1659532/","id":"1659532","publisher":"上海古籍出版社","isbn10":"7532503429","isbn13":"9787532503421","title":"水浒传","url":"https://api.douban.com/v2/book/1659532","alt_title":"","author_intro":"109.8万字","summary":"\n      ","series":{"id":"3741","title":"名家评本四大名著"},"price":"85.00元"},{"rating":{"max":10,"numRaters":129,"average":"8.4","min":0},"subtitle":"一百二十回梅氏藏本《水浒传》","author":["施耐庵"],"pubdate":"2008-1","tags":[{"count":28,"name":"四大名著","title":"四大名著"},{"count":17,"name":"小说","title":"小说"},{"count":14,"name":"中国古典文学","title":"中国古典文学"},{"count":11,"name":"水浒传","title":"水浒传"},{"count":7,"name":"中国","title":"中国"},{"count":6,"name":"施耐庵","title":"施耐庵"},{"count":5,"name":"经典","title":"经典"},{"count":5,"name":"古典名著","title":"古典名著"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s23381793.jpg","binding":"平装","translator":[],"catalog":"","pages":"895","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s23381793.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s23381793.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s23381793.jpg"},"alt":"https://book.douban.com/subject/2701443/","id":"2701443","publisher":"人民出版社","isbn10":"7010066957","isbn13":"9787010066950","title":"水浒传（全2册）","url":"https://api.douban.com/v2/book/2701443","alt_title":"","author_intro":"","summary":"《水浒传(全2册)》内容简介：通行本《水浒传》中，梁山好汉替天行道，最后却接受招安，在征讨方腊的战斗中伤亡大半，幸存的好汉也罕有善终。这样的结尾让许多喜爱《水浒传》的读者感到不满和疑惑，所以才会有小沙弥怀林说宋江是\u201c假道学真强盗\u201d；金圣叹则称其为\u201c狗尾续貂\u201d，索性将它腰折。其实在真正的古本《水浒传》中，梁山好汉是将起义进行到底的，只是经过数百年的岁月更迭，人们很难有机会再见这个版本了。如今，这部梅氏藏本《水浒传》将引领大家重温几百年前的江湖风雨，领略不朽经典的永恒魅力！ \n《水浒传》自面世以来，被人或篡改，或腰斩，或硬加，以致版本繁杂，距离原著原貌愈来愈远，也引发了一部分读者对《水浒传》的不满或误解。此次本社刊印梅氏藏本《水浒传》，就是为了使这部传世奇书的真容得以重现，使一系列关于《水浒传》的谜团真相大白！ \n梅氏藏本《水浒传》是完全出自施耐庵一人之手的《水浒传》，前七十回与通行本一致，但后五十回却与通行的百二十回本截然不同\u2014\u2014梁山好汉没有受招安，甚至没有一员头领阵亡，直到最后一回，他们还在与官军浴血奋战；大败栾廷玉、杀死高衙内、斩除江不良、除灭小张良，惩恶扬善，大快人心；揭阳镇除霸、误走金乡县、怒打丰田镇，众好汉啸聚绿林，梁山泊风云再起！","series":{"id":"25327","title":"四大名著"},"price":"58.00元"},{"rating":{"max":10,"numRaters":100,"average":"8.9","min":0},"subtitle":"","author":["（明）施耐庵，（明）罗贯中  著"],"pubdate":"2002-10","tags":[{"count":16,"name":"中国","title":"中国"},{"count":15,"name":"水浒传","title":"水浒传"},{"count":15,"name":"古典小说","title":"古典小说"},{"count":14,"name":"古典名著","title":"古典名著"},{"count":8,"name":"小说","title":"小说"},{"count":8,"name":"中国文学","title":"中国文学"},{"count":7,"name":"古典文学","title":"古典文学"},{"count":3,"name":"施耐庵","title":"施耐庵"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s5665233.jpg","binding":"","translator":[],"catalog":"引  首第一回  张天师祈禳瘟疫  洪太尉误走妖魔 第二回  王教头私走延安府  九纹龙大闹史家村 第三回  史大郎夜走华阴县  鲁提辖拳打镇关西 第四回  赵员外重修文殊院  鲁智深大闹五台山 第五回  小霸王醉入销金帐  花和尚大闹桃花村 第六回  九纹龙剪迳赤松林  鲁智深火烧瓦罐寺 第七回  花和尚倒拔垂杨柳  豹子头误入白虎堂 第八回  林教头刺配沧州道  鲁智深大闹野猪林 第九回  柴进门招天下客  林冲棒打洪教头 第十回  林教头风雪山神庙  陆虞候火烧草料场 第十一回  朱贵水亭施号箭  林冲雪夜上梁山 第十二回  梁山泊林冲落草  汴京城杨志卖刀 第十三回  急先锋东郭争功  青面兽北京斗武 第十四回  赤发鬼醉卧灵官殿  晁天王认义东溪村 第十五回  吴学究说三阮撞筹  公孙胜应七星聚义 第十六回  杨志押送金银担  吴用智取生辰纲 第十七回  花和尚单打二龙山  青面兽双夺宝珠寺 第十八回  美髯公智稳插翅虎  宋公明私放晁天王 第十九回  林冲水寨大并火  晁盖梁山小聚义 第二十回  梁山泊义士尊晁盖  郓城县月夜走刘唐 第二十一回  虔婆醉打唐牛儿  宋江怒杀阎婆惜 第二十二回  阎婆大闹郓城县  朱仝义释宋公明 第二十三回  横海郡柴进留宾  景阳冈武松打虎 第二十四回  王婆贪贿说风情  郓哥不忿闹茶肆 第二十五回  王婆计啜西门庆  淫妇药鸩武大郎 第二十六回  郓哥大闹授官厅  武松斗杀西门庆 第二十七回  母夜叉孟州道卖人肉　五都头十字坡遇张青 第二十八回  武松威镇平安寨  施恩义夺快活林 第二十九回  施恩重霸孟州道  武松醉打蒋门神 第三十回  施恩三进死囚牢  武松大闹飞云浦 第三十一回  张都兼血溅鸳鸯楼  武行者夜走蜈蚣岭 第三十二回  武行者醉打孔亮  锦毛虎义释宋江 第三十三回  宋江夜看小鳌山  花荣大闹清风寨 第三十四回  镇三山大闹青州道  霹雳火夜走瓦砾场 第三十五回  石将军村店寄书  小李广梁山射雁 第三十六回  梁山泊吴用举戴宗  揭阳岭宋江逢李俊 第三十七回  没遮拦追赶及时雨  船火儿夜闹浔阳江 第三十八回  及时雨会神行太保  黑旋风斗浪里白跳 第三十九回  浔阳楼宋江吟反诗  梁山泊戴宗传假言 第四十回  梁山泊好汉劫法场  白龙庙英雄小聚义 第四十一回  宋江智取无为军  张顺活捉黄文炳 第四十二回  还道村受三卷天书  宋公明遇九天玄女 第四十三回  假李逵剪迳劫单人  黑旋风沂岭杀四虎 第四十四回  锦豹子小径逢戴宗  病关索长街遇石秀 第四十五回  杨雄醉骂潘巧云  石秀智杀裴如海 第四十六回  病关索大闹翠屏山  拚命三火烧祝家店 第四十七回  扑天雕双修生死书  宋公明一打祝家庄 第四十八回  一丈青单捉王矮虎  宋公明二打祝家庄 第四十九回  解珍解宝双越狱  孙立孙新大劫牢 第五十回  吴学究双用连环计  宋公明三打祝家庄 第五十一回  插翅虎枷打白秀英  美髯公误失小衙内 第五十二回  李逵打死殷天锡  柴进失陷高唐州 第五十三回  戴宗智取公孙胜  李逵斧劈罗真人 第五十四回  入云龙斗法破高廉  黑旋风探穴救柴进 第五十五回  高太尉大兴三路兵  呼延灼摆布连环马 第五十六回  吴用使时迁盗甲  汤隆赚徐宁上山 第五十七回  徐宁教使钩镰枪  宋江大破连环马 第五十八回  三山聚义打青州  众虎同心归水泊 第五十九回  吴用赚金铃吊挂  宋江闹西岳华山 第六十回  公孙胜芒砀山降魔  晁天王曾头市中箭 第六十一回  吴用智赚玉麒麟  张顺夜闹金沙渡 第六十二回  放冷箭燕青救主  劫法场石秀跳楼 第六十三回  宋江兵打北京城  关胜议取梁山泊 第六十四回  呼延灼夜月赚关胜  宋公明雪天擒索超 第六十五回  托塔天王梦中显圣  浪里白跳水上报冤 第六十六回  时迁火烧翠云楼  吴用智取大名府 第六十七回  宋江赏马步三军  关胜降水火二将 第六十八回  宋公明夜打曾头市  卢俊义活捉史文恭 第六十九回  东平府误陷九纹龙  宋公明义释双枪将 第七十回  没羽箭飞石打英雄  宋公明弃粮擒壮士 第七十一回  忠义堂石碣受天文  梁山泊英雄排座次 第七十二回  柴进簪花入禁院  李逵元夜闹东京 第七十三回  黑旋风乔捉鬼  梁山泊双献头 第七十四回  燕青智扑擎天柱  李逵寿张乔坐衙 第七十五回  活阎罗倒船偷御酒  黑旋风扯诏谤徽宗 第七十六回  吴加亮布四斗五方旗　宋公明排九公八卦阵 第七十七回  梁山泊十面埋伏  宋公明两嬴童贯 第七十八回  十节度议取梁山泊  宋公明一败高太尉 第七十九回  刘唐放火烧战船  宋江二败高太尉 第八十回  张顺凿漏海鳅船  宋江三败高太尉 第八十一回  燕青月夜遇道君  戴宗定计赚萧让 第八十二回  梁山泊分金大买市  宋公明全伙受招安 第八十三回  宋公明奉招破大辽  陈桥驿滴泪斩小卒 第八十四回  宋公明兵打蓟州城  卢俊义大战玉田县 第八十五回  宋公明夜度益津关  吴学究智取文安县 第八十六回  宋公明大战独鹿山  卢俊义兵陷青石峪 第八十七回  宋公明大战幽州  呼延灼力擒番将 第八十八回  颜统军阵列混天像  宋公明梦授玄女法 第八十九回  宋公明破阵成功  宿太尉颁恩降诏 第九十回  五台山宋江参禅  双林镇燕青遇敌 第九十一回  宋公明兵渡黄河  卢俊义赚城黑夜 第九十二回  振军威小李广神箭  打盖郡智多星密筹 第九十三回  李逵梦闹天池  宋江兵分两路 第九十四回  关胜义降三将  李逵莽陷众人 第九十五回  宋公明忠感后土  乔道清术败宋兵 第九十六回  幻魔君术窘五龙山  入云龙兵围百谷岭 第九十七回  陈观谏官升安抚  琼英处女做先锋 第九十八回  张清缘配琼英  吴用计鸩邬梨 第九十九回  花和尚解脱缘缠井  混江龙水灌太原城 第一百回  张清琼英双建功  陈观宋江同奏捷 第一百一回  谋坟地阴险产逆  踏春阳妖艳生奸 第一百二回  王庆因奸吃官司  龚端被打军师犯 第一百三回  张管营因妾弟丧身  范节级为表兄医脸 第一百四回  段家庄重招新女婿  房山寨双并旧强人 第一百五回  宋公明避暑疗军兵  乔道清回风烧贼寇 第一百六回  书生谈笑却强敌  水军汩没破坚城 第一百七回  宋江大胜纪山军  朱武打破六花阵 第一百八回  乔道清兴雾取城  小旋风藏炮击贼 第一百九回  王庆渡江被捉  宋江剿寇成功 第一百十回  燕青秋林渡射雁  宋江东京城献俘 第百十一回  张顺夜伏金山寺  宋江智取润州城 第百十二回  卢俊义兵分宣州道  宋公明大战毗陵郡 第百十三回  混江龙太湖小结义  宋公明苏州大会垓 第百十四回  宁海军宋江吊孝  涌金门张顺归神 第百十五回  张顺魂捉方天定  宋江智取宁海军 第百十六回  卢俊义分兵歙州道  宋公明大战乌龙镇 第百十七回  睦州城箭射邓元觉  乌龙镇神助宋公明 第百十八回  卢俊义大战昱岭关  宋公明智取清溪洞 第百十九回  鲁智深浙江坐化  宋公明衣锦还乡 第百二十回  宋公明神聚蓼儿洼  徽宗帝梦游梁山泊","pages":"955","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s5665233.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s5665233.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s5665233.jpg"},"alt":"https://book.douban.com/subject/1518090/","id":"1518090","publisher":"三秦出版","isbn10":"7805468419","isbn13":"9787805468419","title":"水浒传","url":"https://api.douban.com/v2/book/1518090","alt_title":"","author_intro":"","summary":"《水浒传》是一部长篇英雄传奇，是中国古代长篇小说的代表作之一，是以宋江起义故事为线索创作出来的。宋江起义发生在北宋徽宗时期，《宋史》的《徽宗本纪》、《侯蒙传》、《张叔夜传》等都有记载。从南宋起，宋江起义的故事就在民间流传，《醉翁谈录》记载了一些独立的有关水浒英雄的传说，《大宋宣和遗事》把许多水浒故事联缀起来，和长篇小说已经很接近。元代出现了不少水浒戏，一批梁山英雄作为舞台形象出现。《水浒传》是宋江起义故事在民间长期流传基础上产生出来的，吸收了民间文学的营养。 《水浒传》是我国人民最喜爱的古典长篇白话小说之一。它产生于明代，是在宋、元以来有关水浒的故事、话本、戏曲的基础上，由作者加工整理、创作而成的。全书以宋江领导的农民起义为主要题材，艺术地再现了中国古代人民反抗压迫、英勇斗争的悲壮画卷。作品充分暴露了封建统治阶级的腐朽和残暴，揭露了当时尖锐对立的社会矛盾和\u201c官逼民反\u201d的残酷现实，成功地塑造了鲁智深、李逵、武松、林冲、阮小七等一批英雄人物。小说故事情节曲折，语言生动，人物性格鲜明，具有高度的艺术成就。但作品歌颂、美化宋江，鼓吹\u201c忠义\u201d和\u201c替天行道\u201d，表现出严重的思想局限。","price":"22.00元"},{"rating":{"max":10,"numRaters":97,"average":"9.0","min":0},"subtitle":"","author":["施耐庵"],"pubdate":"2007-11","tags":[{"count":16,"name":"古典名著","title":"古典名著"},{"count":13,"name":"中国","title":"中国"},{"count":12,"name":"水浒传","title":"水浒传"},{"count":10,"name":"中国古典文学","title":"中国古典文学"},{"count":8,"name":"小说","title":"小说"},{"count":8,"name":"古典","title":"古典"},{"count":6,"name":"文学","title":"文学"},{"count":5,"name":"施耐庵","title":"施耐庵"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s8451357.jpg","binding":"","translator":[],"catalog":"第一回 张天师祈禳瘟疫 洪太尉误走妖魔第二回 王教头私走延安府 九纹龙大闹史家村第三回 史大郎夜走华阴县 鲁提辖拳打镇关西第四回 赵员外重修文殊院 鲁智深大闹五台山第五回 小霸王醉入销金帐 花和尚大闹桃花村第六回 九纹龙剪迳赤松林 鲁智深火烧瓦罐寺第七回 花和尚倒拔垂杨柳 豹子头误入白虎堂第八回 林教头刺配沧州道 鲁智深大闹野猪林第九回 柴进门招天下客 林冲棒打洪教头第十回 林教头风雪山神庙 陆虞候火烧草料场第十一回 朱贵水亭施号箭 林冲雪夜上梁山第十二回 梁山泊林冲落草 汴京城杨志卖刀第十三回 急先锋东郭争功 青面兽北京斗武第十四回 赤发鬼醉卧灵官殿 晁天王认义东溪村第十五回 吴学究说三阮撞筹 公孙胜应七星聚义第十六回 杨志押送金银担 吴用智取生辰网第十七回 花和尚单打二龙山 青面兽双夺宝珠寺第十八回 美髯公智稳插翅虎 宋公明私放晁天王第十九回 林冲水寨大并火 晁盖梁山小夺泊第二十回 梁山泊义士尊晁盖 郓城县月夜走刘唐第二十一回 虔婆醉打唐牛儿 宋江怒杀阎婆惜第二十二回 阎婆大闹郓城县 朱仝义释宋公明第二十三回 横海郡柴进留宾 景阳冈武松打虎第二十四回 王婆贪贿说风情 郓哥不忿闹茶肆第二十五回 王婆计啜西门庆 淫妇药鸩武大郎第二十六回 郓哥大闹授官厅 武松斗杀西门庆第二十七回 母夜叉孟州道卖人肉 武都头十字坡遇张青第二十八回 武松威镇安平寨 施恩义夺快活林第二十九回 施恩重霸孟州道 武松醉打蒋门神第三十回 施恩三人死囚牢 武松大闹飞云浦第三十一回 张都监血溅鸳鸯楼 武行者夜走蜈蚣岭第三十二回 武行者醉打孔亮 锦毛虎义释宋江第三十三回 宋江夜看小鳌山 花荣大闹清风寨第三十四回 镇三山大闹青州道 霹雳火夜走瓦砾场第三十五回 石将军村店寄书 小李广梁山射雁第三十六回 梁山泊吴用举戴宗 揭阳岭宋江逢李俊第三十七回 没遮拦追赶及时雨 船火儿夜闹浔阳江第三十八回 及时雨会神行太保 黑旋风斗浪里白跳第三十九回 浔阳楼宋江吟反诗 梁山泊戴宗传假信第四十回 梁山泊好汉劫法场 白龙庙英雄小聚义第四十一回 宋江智取无为军 张顺活捉黄文烦第四十二回 还道村受三卷天书 宋公明遇九天玄女第四十三回 假李逵剪迳劫单人 黑旋风沂岭杀四虎第四十四回 锦豹子小径逢戴宗 病关索长街遇石秀第四十五回 杨雄醉骂潘巧云 石秀智杀裴如海第四十六回 病关索大闹翠屏山 拼命三火烧祝家店第四十七回 扑天雕双修生死书 宋公明一打祝家庄第四十八回 一丈青单捉王矮虎 宋公明两打祝家庄第四十九回 解珍解宝双越狱 孙立孙新大劫牢第五十回 吴学究双用连环计 宋公明三打祝家庄第五十一回 插翅虎枷打白秀英 美髯公误失小衙内第五十二回 李逵打死殷天锡 柴进失陷高唐州第五十三回 戴宗智取公孙胜 李逵斧劈罗具人第五十四回 入云龙关法破高廉 黑旋风探穴救柴进第五十五回 高太尉大兴三路兵 呼延灼摆布连环马第五十六回 吴用使时迁盗甲 汤隆赚徐宁上山第五十七回 徐宁教使钩镰枪 宋江大破连环马第五十八回 三山聚义打青州 众虎同心归水泊第五十九回 吴用赚金铃吊挂 宋江闹西狱华山第六十回 公孙胜芒砀山降魔 晁天王曾头市中箭第六十一回 吴用智赚玉麒麟 张顺夜闹金沙渡第六十二回 放冷箭燕青救主 劫法场石秀跳楼第六十三回 宋江兵打北京城__关胜议取梁山泊第六十四回 呼延灼夜月赚关胜 宋公明雪天擒索超第六十五回 托塔天王梦中显圣 浪里白跳水上报冤第六十六回 时迁火烧翠云楼 吴用智取大名府第六十七回 宋江赏马步三军 关胜降水火二将第六十八回 宋公明夜打曾头市 卢俊义活捉史文恭第六十九回 东平府误陷九纹龙 宋公明义释双枪将第七十回 没羽箭飞石打英雄 宋公明弃粮擒壮士第七十一回 忠义堂石碣受天文 梁山泊英雄排座次第七十二回 柴进簪花入禁院 李逵元夜闹东京第七十三回 黑旋风乔捉鬼 梁山泊双献头第七十四回 燕青智扑擎天柱 李逵寿张乔坐衙第七十五回 活阎罗倒船偷御酒 黑旋风扯诏谤徽宗第七十六回 吴加亮布四斗五方旗 宋公明排九宫八卦阵第七十七回 梁山泊十面埋伏 宋公明两嬴童贯第七十八回 十节度议取梁山泊 宋公明一败高太尉第七十九回 刘唐放火烧战船 宋江两败高太尉第八十回 张顺凿漏海鳅船 宋江三败高太尉第八十一回 燕青月夜遇道君 戴宗定计赚萧让第八十二回 梁山泊分金大买市 宋公明全夥受招安第八十三回 宋公明奉诏破大辽 陈桥驿滴泪斩小卒第八十四回 宋公明兵打蓟州城 卢俊义大战玉田县第八十五回 宋公明夜度益津关 吴学究智取文安县第八十六回 宋公明大战独鹿山 卢俊义兵陷青石峪第八十七回 宋公明大战幽州 呼延灼力擒番将第八十八回 颜统军阵列混天像 宋公明梦授玄女法第八十九回 宋公明破阵成功 宿太尉颁恩降诏第九十回 五台山宋江参禅 双林镇燕青遇故第九十一回 宋公明兵渡黄河 卢俊义赚城黑夜第九十二回 振军威小李广神箭 打盖郡智多星密筹第九十三回 李逵梦闹天池 宋江兵分两路第九十四回 关胜义降三将 李逵莽陷众人第九十五回 宋公明忠感后土 乔道清术败宋兵第九十六回 幻魔君术窘五龙山 入云龙兵围百谷岭第九十七回 陈瑾谏官升安抚 琼英处女做先锋第九十八回 张清缘配琼英 吴用计鸩邬梨第九十九回 花和尚解脱缘缠井 混江龙水灌太原城第一百回 张清琼英双建功 陈瓘宋江同奏捷第一百一回 谋坟地阴险产逆 踏春阳妖艳生奸第一百二回 王庆因奸吃官司 龚端被打师军犯第一百三回 张管营因妾弟丧身 范节级为表兄医脸第一百四回 段家庄重招新女婿 房山寨双并旧强人第一百五回 宋公明避暑疗军兵 乔道清回风烧贼寇第一百六回 书生谈笑却强敌 水军汨没破坚城第一百七回 宋江大胜纪山军 朱武打破立花阵第一百八回 乔道清兴雾取城 小旋风藏炮击贼第一百九回 王庆渡江被捉 宋江剿寇成功第一百十回 燕青秋林渡射雁 宋江东京城献俘第一百十一回 张顺夜伏金山寺 宋江智取润州城第一百十二回 卢俊义分兵宣州道 宋公明大战毗陵郡第一百十三回 混江龙太湖小结义 宋公明苏州大会垓第一百十四回 宁海军宋江吊孝 涌金门张顺归神第一百十五回 张顺魂捉方天定 宋江智取宁海军第一百十六回 卢俊义分兵歙州道 宋公明大战乌龙岭第一百十七回 睦州城箭射邓元觉 乌龙岭神助宋公明第一百十八回 卢俊义大战昱岭关 宋公胆智取清溪洞第一百十九回 鲁智深浙江坐化 宋公明衣锦还乡第一百二十回 宋公明神聚蓼儿洼 徽宗帝梦游梁山泊","pages":"958","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s8451357.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s8451357.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s8451357.jpg"},"alt":"https://book.douban.com/subject/2343073/","id":"2343073","publisher":"万卷","isbn10":"780759084X","isbn13":"9787807590842","title":"水浒传","url":"https://api.douban.com/v2/book/2343073","alt_title":"","author_intro":"","summary":"《水浒传》是我国文学史上第一部描写农民起义的长篇小说，中国古典 \u201c四大名著\u201d之一。《水浒传》犹如一幅长长的历史画卷，我们从中看到的不仅是可歌可泣的农民起义本身，还有宋代的政治文化、市井风情和社会景观，从某种意义上来说，它是那个时代的全记录。\n《水浒传》是我国第一部以农民起义为题材的长篇章回小说，是我国文学史上一座巍然屹立的丰碑，也是世界文学宝库中一颗光彩夺目的明珠。数百年来，它一直深受我国人民的喜爱，并被译为多种文字，成为我国流传最为广泛的古代长篇小说之一。","price":"24.80元"},{"rating":{"max":10,"numRaters":383,"average":"8.4","min":0},"subtitle":"蔡志忠古典幽默漫画","author":["蔡志忠"],"pubdate":"1992-8","tags":[{"count":130,"name":"蔡志忠","title":"蔡志忠"},{"count":120,"name":"漫画","title":"漫画"},{"count":44,"name":"台湾","title":"台湾"},{"count":15,"name":"台湾漫画","title":"台湾漫画"},{"count":14,"name":"绘本","title":"绘本"},{"count":12,"name":"水浒传--英雄好汉的本色","title":"水浒传--英雄好汉的本色"},{"count":11,"name":"水浒","title":"水浒"},{"count":8,"name":"童年回忆","title":"童年回忆"}],"origin_title":"","image":"https://img3.doubanio.com/view/subject/m/public/s1259551.jpg","binding":"平装","translator":[],"catalog":"目次\n蔡志忠说蔡志忠\n水浒全图\n话水浒・说从头\n水浒传\u2015\u2015英雄好汉的本色\n禁军教头 王进\n九纹龙 史进\n花和尚 鲁智深\n豹子头 林冲\n行者 武松\n及时雨 宋江\n青面兽 杨志\n","pages":"135","images":{"small":"https://img3.doubanio.com/view/subject/s/public/s1259551.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s1259551.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s1259551.jpg"},"alt":"https://book.douban.com/subject/1077965/","id":"1077965","publisher":"三联书店","isbn10":"7108005263","isbn13":"9787108005267","title":"水浒传--英雄好汉的本色","url":"https://api.douban.com/v2/book/1077965","alt_title":"","author_intro":"作者简介\n本名/蔡志忠\n籍贯/台湾彰化\n出生/ 一九四八年二月 二日\n经历/ 一九六三年起开始画连环漫画\n一九七 一年任光启社电视美术指导\n一九七六年成立远东卡通公司、龙卡通公司，\n拍摄卡通作品有《老夫子》第 一第三集、《乌龙院》\n《老夫子》第 一集获最佳卡通影片金马奖\n一九八三年开始在报章杂志发表四格漫画，作品并在\n新加坡、香港、马来西亚、日 本报章长期连载\n一九八五年获选为台湾十大杰出青年\n\n\n","summary":"水浒传又名《忠义水浒传》。长篇小说。全书以描写梁山英雄的反抗斗争为主要题材，塑造了李逵、武松、林冲、鲁智深等梁山英雄人物，暴露了封建统治阶级的残暴和腐朽，揭示了当时的社会矛盾，反映了市民阶层的人生向往。蔡志忠是一位台湾著名的漫画家，他以夸张的漫画手法重新塑造了水浒传。使人们在轻松幽默之余，感受到漫画作品之中，蕴藏的深刻的社会意义。","series":{"id":"4091","title":"蔡志忠古典幽默漫画"},"price":"5.80元"},{"rating":{"max":10,"numRaters":140,"average":"8.0","min":0},"subtitle":"","author":["蔡志忠编绘"],"pubdate":"2006-9","tags":[{"count":46,"name":"漫画","title":"漫画"},{"count":41,"name":"蔡志忠","title":"蔡志忠"},{"count":5,"name":"台湾","title":"台湾"},{"count":5,"name":"三国志","title":"三国志"},{"count":4,"name":"绘本","title":"绘本"},{"count":3,"name":"水浒传","title":"水浒传"},{"count":2,"name":"本土漫画","title":"本土漫画"},{"count":2,"name":"历史","title":"历史"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s9069939.jpg","binding":"平装","translator":[],"catalog":"","pages":"283","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s9069939.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s9069939.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s9069939.jpg"},"alt":"https://book.douban.com/subject/1922567/","id":"1922567","publisher":"生活·读书·新知三联书店","isbn10":"7108024721","isbn13":"9787108024725","title":"三国志 水浒传","url":"https://api.douban.com/v2/book/1922567","alt_title":"","author_intro":"","summary":"三国故事和梁山好汉的故事通过各种民间文学形式的长期积累，终于在[小说版]的《三国演义》和《水浒传》中大放异彩，成为中国文学史上的经典作品。而蔡志忠先生一直以来以改编经典古籍和经典小说为主要创作方面，成绩斐然。于是就有了本书。作者从小说版的情节出发，再融入[蔡子版]独家的趣味联想和时事妙解，成为蔡志忠暂时封笔前最重要的幽默作品。至于欲知究竟如何好看，便请看本书吧！","series":{"id":"9849","title":"蔡志忠幽默漫画"},"price":"18.00元"},{"rating":{"max":10,"numRaters":69,"average":"8.4","min":0},"subtitle":"","author":["施耐庵","罗贯中"],"pubdate":"1993-12-1","tags":[{"count":7,"name":"水浒传","title":"水浒传"},{"count":6,"name":"施耐庵","title":"施耐庵"},{"count":6,"name":"小说","title":"小说"},{"count":5,"name":"古典文学","title":"古典文学"},{"count":5,"name":"古典名著","title":"古典名著"},{"count":4,"name":"四大名著","title":"四大名著"},{"count":3,"name":"中国文学","title":"中国文学"},{"count":2,"name":"经典","title":"经典"}],"origin_title":"","image":"https://img1.doubanio.com/view/subject/m/public/s1149449.jpg","binding":"盒装","translator":[],"catalog":"楔子  张天师祈禳瘟疫  洪太尉误走妖魔\n第一回  王教头私走延安府  九纹龙大闹史家村\n第二回  史大郎夜走华阴县  鲁提辖拳打镇关西\n第三回  赵员外重修文殊院  鲁知深大闹五台山\n第四回  小霸王醉入销金帐  花和尚大闹桃花村\n第五回  九纹龙剪径赤松林  鲁知深火烧瓦官寺\n\u2026\u2026\n","pages":"1144","images":{"small":"https://img1.doubanio.com/view/subject/s/public/s1149449.jpg","large":"https://img1.doubanio.com/view/subject/l/public/s1149449.jpg","medium":"https://img1.doubanio.com/view/subject/m/public/s1149449.jpg"},"alt":"https://book.douban.com/subject/1114653/","id":"1114653","publisher":"花城出版社","isbn10":"7536016190","isbn13":"9787536016194","title":"水浒传","url":"https://api.douban.com/v2/book/1114653","alt_title":"","author_intro":"","summary":"","price":"99.00元"}]
     */

    private int count;
    private int start;
    private int total;
    private List<BooksBean> books;

    public int getCount() {
        return count;
    }

    public void setCount(int count) {
        this.count = count;
    }

    public int getStart() {
        return start;
    }

    public void setStart(int start) {
        this.start = start;
    }

    public int getTotal() {
        return total;
    }

    public void setTotal(int total) {
        this.total = total;
    }

    public List<BooksBean> getBooks() {
        return books;
    }

    public void setBooks(List<BooksBean> books) {
        this.books = books;
    }

    public static class BooksBean {
        /**
         * rating : {"max":10,"numRaters":24818,"average":"8.5","min":0}
         * subtitle :
         * author : ["[明] 施耐庵","罗贯中"]
         * pubdate : 1997-1
         * tags : [{"count":4116,"name":"古典文学","title":"古典文学"},{"count":2969,"name":"水浒传","title":"水浒传"},{"count":2553,"name":"四大名著","title":"四大名著"},{"count":2490,"name":"小说","title":"小说"},{"count":1402,"name":"中国","title":"中国"},{"count":1356,"name":"古典名著","title":"古典名著"},{"count":1046,"name":"经典","title":"经典"},{"count":976,"name":"名著","title":"名著"}]
         * origin_title :
         * image : https://img3.doubanio.com/view/subject/m/public/s1147854.jpg
         * binding : 平装
         * translator : []
         * catalog : 引首
         第一回 张天师祈禳瘟疫 洪太尉误走妖魔
         第二回 王教头私走延安府 九纹龙大闹史家村
         第三回 史大郎夜走华阴县 鲁提辖拳打镇关西
         第四回 赵员外重修文殊院 鲁智深大闹五台山
         第五回 小霸王醉入销金帐 花和尚大闹桃花村
         第六回 九纹龙剪径赤松林 鲁智深火烧瓦罐寺
         第七回 花和尚倒拔垂杨柳 豹子头误入白虎堂
         第八回 林教头刺配沧州道 鲁智深大闹野猪林
         第九回 柴进门招天下客 林冲棒打洪教头
         第十回 林教头风雪山神庙 陆虞候火烧草料场
         第十一回 朱贵水亭施号箭 林冲雪夜上梁山
         第十二回 梁山泊林冲落草 汴京城杨志卖刀
         第十三回 急先锋东郭争功 青面兽北京斗争
         第十四回 赤发鬼醉卧灵官殿 晁天王认义东溪村
         ……
         * pages : 1314
         * images : {"small":"https://img3.doubanio.com/view/subject/s/public/s1147854.jpg","large":"https://img3.doubanio.com/view/subject/l/public/s1147854.jpg","medium":"https://img3.doubanio.com/view/subject/m/public/s1147854.jpg"}
         * alt : https://book.douban.com/subject/1008357/
         * id : 1008357
         * publisher : 人民文学出版社
         * isbn10 : 7020008747
         * isbn13 : 9787020008742
         * title : 水浒传（全二册）
         * url : https://api.douban.com/v2/book/1008357
         * alt_title :
         * author_intro :
         * summary : 《水浒传》是我国第一部以农民起义为题材的长篇章回小说，是我国文学史上一座巍然屹立的丰碑，也是世界文学宝库中一颗光彩夺目的明珠。数百年来，它一直深受我国人民的喜爱，并被译为多种文字，成为我国流传最为广泛的古代长篇小说之一。
         《水浒传》具体而生动地描写了以宋江为首的农民起义发生、发展直至失财的整个过程，揭露了封建社会的黑暗、腐朽和统治阶级的种种罪恶，热情歌颂了起义英雄的反抗精神和正义行动，塑造了一大批梁山好汉的光辉形象，形象地揭示了封建社会“官逼民反”的客观真理和农民起义失败的内在原因。
         * series : {"id":"106","title":"中国古典文学读本丛书"}
         * price : 50.60元
         */

        private RatingBean rating;
        private String subtitle;
        private String pubdate;
        private String origin_title;
        private String image;
        private String binding;
        private String catalog;
        private String pages;
        private ImagesBean images;
        private String alt;
        private String id;
        private String publisher;
        private String isbn10;
        private String isbn13;
        private String title;
        private String url;
        private String alt_title;
        private String author_intro;
        private String summary;
        private SeriesBean series;
        private String price;
        private List<String> author;
        private List<TagsBean> tags;
        private List<?> translator;

        public RatingBean getRating() {
            return rating;
        }

        public void setRating(RatingBean rating) {
            this.rating = rating;
        }

        public String getSubtitle() {
            return subtitle;
        }

        public void setSubtitle(String subtitle) {
            this.subtitle = subtitle;
        }

        public String getPubdate() {
            return pubdate;
        }

        public void setPubdate(String pubdate) {
            this.pubdate = pubdate;
        }

        public String getOrigin_title() {
            return origin_title;
        }

        public void setOrigin_title(String origin_title) {
            this.origin_title = origin_title;
        }

        public String getImage() {
            return image;
        }

        public void setImage(String image) {
            this.image = image;
        }

        public String getBinding() {
            return binding;
        }

        public void setBinding(String binding) {
            this.binding = binding;
        }

        public String getCatalog() {
            return catalog;
        }

        public void setCatalog(String catalog) {
            this.catalog = catalog;
        }

        public String getPages() {
            return pages;
        }

        public void setPages(String pages) {
            this.pages = pages;
        }

        public ImagesBean getImages() {
            return images;
        }

        public void setImages(ImagesBean images) {
            this.images = images;
        }

        public String getAlt() {
            return alt;
        }

        public void setAlt(String alt) {
            this.alt = alt;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getPublisher() {
            return publisher;
        }

        public void setPublisher(String publisher) {
            this.publisher = publisher;
        }

        public String getIsbn10() {
            return isbn10;
        }

        public void setIsbn10(String isbn10) {
            this.isbn10 = isbn10;
        }

        public String getIsbn13() {
            return isbn13;
        }

        public void setIsbn13(String isbn13) {
            this.isbn13 = isbn13;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getAlt_title() {
            return alt_title;
        }

        public void setAlt_title(String alt_title) {
            this.alt_title = alt_title;
        }

        public String getAuthor_intro() {
            return author_intro;
        }

        public void setAuthor_intro(String author_intro) {
            this.author_intro = author_intro;
        }

        public String getSummary() {
            return summary;
        }

        public void setSummary(String summary) {
            this.summary = summary;
        }

        public SeriesBean getSeries() {
            return series;
        }

        public void setSeries(SeriesBean series) {
            this.series = series;
        }

        public String getPrice() {
            return price;
        }

        public void setPrice(String price) {
            this.price = price;
        }

        public List<String> getAuthor() {
            return author;
        }

        public void setAuthor(List<String> author) {
            this.author = author;
        }

        public List<TagsBean> getTags() {
            return tags;
        }

        public void setTags(List<TagsBean> tags) {
            this.tags = tags;
        }

        public List<?> getTranslator() {
            return translator;
        }

        public void setTranslator(List<?> translator) {
            this.translator = translator;
        }

        public static class RatingBean {
            /**
             * max : 10
             * numRaters : 24818
             * average : 8.5
             * min : 0
             */

            private int max;
            private int numRaters;
            private String average;
            private int min;

            public int getMax() {
                return max;
            }

            public void setMax(int max) {
                this.max = max;
            }

            public int getNumRaters() {
                return numRaters;
            }

            public void setNumRaters(int numRaters) {
                this.numRaters = numRaters;
            }

            public String getAverage() {
                return average;
            }

            public void setAverage(String average) {
                this.average = average;
            }

            public int getMin() {
                return min;
            }

            public void setMin(int min) {
                this.min = min;
            }
        }

        public static class ImagesBean {
            /**
             * small : https://img3.doubanio.com/view/subject/s/public/s1147854.jpg
             * large : https://img3.doubanio.com/view/subject/l/public/s1147854.jpg
             * medium : https://img3.doubanio.com/view/subject/m/public/s1147854.jpg
             */

            private String small;
            private String large;
            private String medium;

            public String getSmall() {
                return small;
            }

            public void setSmall(String small) {
                this.small = small;
            }

            public String getLarge() {
                return large;
            }

            public void setLarge(String large) {
                this.large = large;
            }

            public String getMedium() {
                return medium;
            }

            public void setMedium(String medium) {
                this.medium = medium;
            }
        }

        public static class SeriesBean {
            /**
             * id : 106
             * title : 中国古典文学读本丛书
             */

            private String id;
            private String title;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class TagsBean {
            /**
             * count : 4116
             * name : 古典文学
             * title : 古典文学
             */

            private int count;
            private String name;
            private String title;

            public int getCount() {
                return count;
            }

            public void setCount(int count) {
                this.count = count;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }
    }
}
